Repository: SergeiKutanov/placeholder-service
Catalog: src/AppBundle/Resources/translations/messages.*.xlf
Languages: ru

source: Toggle navigation
ru: Открыть меню

source: Placeholder Image
ru: Генератор картинок заглушек

source: Build placeholder image online
ru: Создайте свою картинку заглушку

source: Use our placeholder image creation tool to build your image online
ru: Воспользуйтесь нашим генератором картинок заглушек онлайн и создайте свой индивидуальный вариант

source: Placeholder building tool
ru: Генератор картинки заглушки

source: Create a placeholder image
ru: Создайте картинку заглушку

source: Use our online tool to create your next placeholder image
ru: Создайте свою картинку заглушку при помощи нашего генератора

source: Text
ru: Текст

source: Some Text
ru: Любой текст

source: Enter text to be printed on the image (default value - empty)
ru: Введите текст для картинки (значение по-умолчанию - пустая строка)

source: Width (px)
ru: Ширина (px)

source: Enter width for your image (default value - 300)
ru: Введите ширину картинки (значение по-умолчанию - 300)

source: Height (px)
ru: Высота (px)

source: Enter height for your image (default value - 300)
ru: Введите высоту картинки (значение по-умолчанию - 300)

source: Backrgound Color (HEX)
ru: Цвет фона (HEX)

source: Font Color (HEX)
ru: Цвет шрифта (HEX)

source: Font Size (px)
ru: Размер шрифта (px)

source: Get Placeholder
ru: Открыть картинку заглушку

source: Url parameters definition
ru: Описание параметров URL

source: Let's go through with the url's parameters. There are 6 parameters in total none of which are required.
ru: Рассмотрим параметры URL для генерации картинки заглушки. Существует 6 допустимых параметров, все они не являются обязательными.

source: They are
ru: Список параметров

source: text to be printed on the placeholder image. Should be url encoded.
ru: текст, который будет напечатан на картинке. Значение параметра должно быть обработано функцией url_encode

source: default: empty
ru: значение по-умолчанию: пустая строка

source: integer value of image width in pixels
ru: целочисленнное значение ширины картинки в пикселях

source: default: 300
ru: значение по-умолчанию: 300

source: integer value of image height in pixels
ru: целочисленное значение высоты картинки в пикселях

source: default: FFFFFF
ru: значение по-умолчанию: FFFFFF

source: hex value of the font's color. Omit the pound sign (#) as well
ru: HEX хначение цвета шрифта. Символ (#) не указывается

source: default: 555555
ru: значение по-умолчанию: 555555

source: integer value in pixels for font's size
ru: целочисленное значение размера шрифта в пикселях

source: default: 14
ru: значение по-умолчанию: 14

source: Help us running
ru: Окажите помощи в поддержании сервиса

source: If you like our service, please, donate to help us run our project.
ru: Если вы используете наш генератор картинок изображений, мы будем рады любой помощи.

source: Disclaimer
ru: Генератор картинок заглушек

source: Let's get through with our placeholder creation tool.
ru: Рассмотрим как пользоваться генератором картинок заглушек

source: The form on the left is already filled with default values. Most of them are self explanatory. But we're going to make sure there are no questions left behind.
ru: Мы заранее для вас заполнили значения полей генератора. Названия большинства из них говорят сами за себя. Но все же опишем все их по отдельности, чтобы не соталось вопросов.

source: Text field
ru: Поле Текст

source: Use it to define the text to be printed on the placeholder image. Or just leave it blank.
ru: Укажите текст, который вы хотите получить на картинке заглушке. Поле можно оставить пустым.

source: Width and Height fields
ru: Поля Высота и Ширина

source: These field are used to define the placeholder's size in pixels.
ru: В этих полях вы можете изменить размеры картинки заглушки в пикселях.

source: Background Color
ru: Цвет фона

source: Placeholder's background color. Use hex value to define it. You can enter it directly or click the right part of the input field (the greyed one) and use a little color picker popup.
ru: Укажите HEX значения цвета, который вы хотели бы использовать в качестве фона картинки.

source: Font Color and Size fields
ru: Цвета и размер шрифта

source: Use these to define font's properties.
ru: В этих полях вы можете указать не только размер шрифта в пикселях, но и его цвет, указав HEX значение.

source: Push the button
ru: Генерируем

source: After you are done with the parameters push the "Get Placeholder" button. You'll see a popup window with the image you create. In that window you can either copy and paste the url of the image or simply download the image itself.
ru: Как только вы указали все необходимые параметры, можете смело нажимать на кнопку "Открыть картинку заглушку". Вы увидите новое окно, где будет изображена сама картинка. В этом окне вы можете скачать картинку или скопировать её URL.

source: That's your placeholder
ru: Ваша картинка заглушка

source: Download Image
ru: Скачать картинку

source: Close
ru: Закрыть

source: Placeholder Image Service
ru: Генератор картинки заглушки

source: Quick and Simple
ru: Быстро и легко

source: It's really easy to use
ru: Наш генератор очень прост в использовании

source: Just use our %link_start%online placeholder building service%link_end% to create your own crafted placeholder image.
ru: Просто воспользуйтесь %link_start%генератором картинки заглушки%link_end% чтобы создать свой вариант изображения.

source: With our %link_start%placeholder builder%link_end% create an image
ru: Создайте изображение с нашим %link_start%генератором картинок заглушек%link_end%

source: Download the generated url or the image itself form the %link_start%our building tool%link_end%
ru: Скопируйте url или саму картинку из %link_start%генератора картинок заглушек%link_end%

source: Insert either the url as image's source attribute or the downloaded image
ru: Используйте скопированный url в качестве атрибута src изображения на вашем сайте или сохраните само иображение

source: These are the things you can manipulate
ru: Что можно изменять в изображении?

source: Of course you can change the printed text itself
ru: Само собой, указывайте нужный вам текст

source: Then goes font size
ru: А так же размер шрифта

source: And font color
ru: И его цвет

source: Certainly you can change placeholder image background color
ru: Не забудьте установить необходимый цвет фона

source: And the size of the image
ru: И, конечно, размер картинки заглушки

source: You can either download the image or use the url we provide you with
ru: Затем либо скачайте саму картинку, или скопируйте её url адрес

source: Placeholder Example of size 500x300
ru: Пример картинки заглушки размером 500x300

source: We created this image
ru: Мы только что сгенерировали это изображение

source: And we used the following query to create it
ru: А вот url для его генерации

source: I'm smaller, just 300x150
ru: Изменяйте размер - 300x150

source: Need a different size?
ru: Не подходит размер картинки?

source: Simply change a few query parameters
ru: Достаточно изменить несколько параметров в url

source: Add more colors
ru: Добавьте цвета

source: These are not all color we know of!
ru: Используйте любой цвет!

source: Again, couldn't be easier.
ru: Нет ничего проще.

source: placeholder, image, create, online, generate, tool
ru: заглушка, картинка, создать, онлайн, генератор, служба

source: hex value of background color for the placeholder image. Omit the pound sign(#)
ru: HEX значение цвета фона картинки. Знак (#) указывать не нужно
